In [23]:
import pandas as pd
log = pd.read_csv('log.csv', header=None)
display(log)

                                    0                     1        2        3
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [14]:
log.columns = ['user_id', 'time', 'bet', 'win']
log.columns

Index(['user_id', 'time', 'bet', 'win'], dtype='object')

In [3]:
log.time.isna().sum()

15

In [4]:
log1 = log.dropna(axis=1)
display(log1)

                              user_id
0    Запись пользователя № - user_919
1    Запись пользователя № - user_973
2    Запись пользователя № - user_903
3    Запись пользователя № - user_954
4    Запись пользователя № - user_954
..                                ...
995  Запись пользователя № - user_984
996                            #error
997                            #error
998                            #error
999                            #error

[1000 rows x 1 columns]

In [5]:
log2 = log.dropna(axis=0)
display(log2)

,user_id,time,bet,win
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0
151,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0
189,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0
205,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0
...,...,...,...,...
967,Запись пользователя № - user_975,[2019-04-19 22:25:15,1000.0,6108.0
971,Запись пользователя № - user_912,[2019-04-20 10:35:49,10554.0,31799.0
972,Запись пользователя № - user_926,[2019-04-20 10:35:50,10354.0,30244.0
976,Запись пользователя № - user_970,[2019-04-20 10:35:54,10354.0,30691.0
991,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0

In [6]:
log3 = log.dropna(subset=['user_id', 'time'])
display(log3)

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

In [7]:
log3.isna().sum()

user_id      0
time         0
bet        513
win        852
dtype: int64

In [8]:
log4 = log.dropna(subset=['time'])
display(log4)

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

In [9]:
log5 = log.drop_duplicates(subset=['user_id', 'time'])

In [10]:
log5

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[986 rows x 4 columns]

In [11]:
log5.time.count()

985

In [17]:
display(log)

                              user_id                  time      bet      win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [18]:
type(log['time'][0])

str

In [19]:
from datetime import datetime
import pandas as pd
log['time'] = log['time'].apply(lambda x: x[1:])
log6 = log.dropna(subset=['time'])
#log6['time'] = pd.to_datetime(log6['time']) 
#log6['time'] =  log6['time'].apply(lambda x: datetime.strptime(x,'%Y-%m-%d %H:%M:%S'))
#display(log6)

TypeError: 'float' object is not subscriptable

In [ ]:
log6.time.max()[:10]

In [27]:
from datetime import datetime
import pandas as pd
log = pd.read_csv("log.csv", header = None)   
log.columns = ['user_id', 'time', 'bet', 'win'] 
log = log.dropna(subset = ['time']) 
log['time'] = log['time'].apply(lambda x: x[1:])
log['time'] = pd.to_datetime(log['time']) 
#log['time'] =  log['time'].apply(lambda x: datetime.strptime(x,'%Y-%m-%d %H:%M:%S'))

In [28]:
type(log['time'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [29]:
log.time.max()

Timestamp('2019-04-20 18:10:07')

In [15]:
log.head(20)

,user_id,time,bet,win
0,Запись пользователя № - user_919,[2019-01-01 14:06:51,NaN,NaN
1,Запись пользователя № - user_973,[2019-01-01 14:51:16,NaN,NaN
2,Запись пользователя № - user_903,[2019-01-01 16:31:16,NaN,NaN
3,Запись пользователя № - user_954,[2019-01-01 17:17:51,NaN,NaN
4,Запись пользователя № - user_954,[2019-01-01 21:31:18,NaN,NaN
5,Запись пользователя № - user_917,[2019-01-01 23:34:55,156789.0,NaN
6,Запись пользователя № - user_900,[2019-01-01 4:37:25,NaN,NaN
7,Запись пользователя № - user_980,[2019-01-01 6:31:23,NaN,NaN
8,Запись пользователя № - user_906,[2019-01-02 10:57:08,NaN,NaN
9,Запись пользователя № - user_952,[2019-01-02 16:55:06,NaN,NaN
10,Запись пользователя № - user_972,[2019-01-02 20:47:54,NaN,NaN
11,Запись пользователя № - user_966,[2019-01-02 21:32:20,NaN,NaN
12,Запись пользователя № - user_964,[2019-01-02 21:32:35,NaN,NaN
13,Запись пользователя № - user_978,[2019-01-02 5:25:40,NaN,NaN
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
15,Запись пользователя № - user_968,[2019-01-02 9:32:24,NaN,NaN
16,Запись пользователя № - user_974,[2019-01-03 10:43:41,NaN,NaN
17,Запись пользователя № - user_998,[2019-01-03 11:29:08,NaN,NaN
18,Запись пользователя № - user_990,[2019-01-03 13:12:46,NaN,NaN
19,Запись пользователя № - user_942,[2019-01-03 14:03:21,98753.0,NaN

In [30]:
log.time.dt.minute.value_counts()

36    25
31    23
6     22
50    22
43    21
14    21
18    21
12    21
5     21
40    21
29    21
53    21
48    20
2     20
45    20
57    20
58    20
27    19
21    19
56    19
54    18
9     18
20    18
3     18
35    18
34    18
33    18
47    18
10    17
51    17
55    16
25    16
17    16
37    15
15    15
16    15
49    15
30    15
24    15
38    15
28    15
4     14
19    14
7     14
44    14
32    14
1     13
59    13
41    13
23    12
39    12
0     12
13    11
22    11
42    11
46    10
52    10
8      9
26     9
11     6
Name: time, dtype: int64

In [31]:
log.time.dt.month.value_counts(ascending=True)

4    170
2    259
3    264
1    292
Name: time, dtype: int64

In [32]:
log.time.dt.dayofweek.isin([5, 6]).sum()

283

In [19]:
from datetime import datetime
import pandas as pd
log = pd.read_csv("log.csv", header=None)
log.columns = ['user_id', 'time', 'bet', 'win']
log = log.dropna(subset=['time'])
log['time'] = log['time'].apply(lambda x: x[1:])
log['time'] = pd.to_datetime(log['time'])
log['hour'] = log['time'].dt.hour


def time_of_the_day(hour):
    if 0 <= hour < 6:
        result = 'ночь'
    elif 6 <= hour < 12:
        result = 'утро'
    elif 12 <= hour < 18:
        result = 'день'
    elif 18 <= hour < 24:
        result = 'вечер'
    else:
        result = np.nan
    return result

log['timeday'] = log['hour'].apply(time_of_the_day)
log.timeday.value_counts(ascending=True)

вечер    227
день     240
утро     253
ночь     265
Name: timeday, dtype: int64

In [20]:
log['hour']

0      14
1      14
2      16
3      17
4      21
       ..
991    12
992    14
993    17
994    18
995     9
Name: hour, Length: 985, dtype: int64

In [21]:
import pandas as pd
log = pd.read_csv("log.csv", header=None)
log.columns = ['user_id', 'time', 'bet', 'win']
log.bet = log['bet'].fillna(0)
log.bet.value_counts()

0.0          515
500.0         50
100.0         48
300.0         42
800.0         42
200.0         40
400.0         40
700.0         38
600.0         37
1000.0        37
900.0         30
9754.0        10
10554.0       10
10154.0        7
10254.0        7
10454.0        6
9954.0         6
10754.0        5
10654.0        5
10354.0        4
10054.0        4
9854.0         2
5000.0         1
27000.0        1
9876.0         1
156789.0       1
12945.0        1
12548.0        1
145732.0       1
1678321.0      1
98753.0        1
123981.0       1
104540.0       1
8700.0         1
950.0          1
8734.0         1
7650.0         1
Name: bet, dtype: int64

In [22]:
log = pd.read_csv("log.csv", header=None)
log.columns = ['user_id', 'time', 'bet', 'win']
log.bet = log['bet'].fillna(0)

def fillna_win(row):  
    if pd.isna(row.win) and row.bet == 0:
        row.win = 0
    elif pd.isna(row.win) and row.bet > 0:
        row.win = -row.bet
    else:
        row.win = row.win
    return row  
  
# Применяем функцию  
new_win = log.apply(lambda row: fillna_win(row), axis=1)  
  
# Заменяем старый столбец с пропусками на новый без пропусков  
log['win'] = new_win
(new_win.win < 0).sum()

347

In [23]:
log = pd.read_csv('log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']
log.bet=log['bet'].fillna(0)
log.win=log['win'].fillna(0)
#log['net']=log['win']-log['bet']

def fill_net(row):
    if row.win<0:
        return row.win
    else: 
        return row.win-row.bet
net = log.apply(lambda row: fill_net(row), axis=1)
log['net'] = net
(log.net>0).sum()

138

In [24]:
log.net

0          0.0
1          0.0
2          0.0
3          0.0
4          0.0
        ...
995    -9754.0
996    19211.0
997   -10454.0
998    -1000.0
999   -10754.0
Name: net, Length: 1000, dtype: float64

In [25]:
round(log[log.net>0].net.mean())

80253

In [26]:
round(log[log.net>0].net.median())

5347

In [27]:
log = pd.read_csv('log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']
log.bet=log['bet'].fillna(0)
log.win=log['win'].fillna(0)
log['net']=log['win']-log['bet']
(log[log.bet>0].count()/log.bet.count())*100

user_id    48.5
time       47.2
bet        48.5
win        48.5
net        48.5
dtype: float64

In [28]:
log[log.bet>0].mean()

bet     6785.738144
win    27207.630928
net    20421.892784
dtype: float64

In [29]:
log[log.net!=0].net.mean()

20421.892783505155

In [30]:
log[log.net<0].net.mean()

-3372.743515850144

In [31]:
(log[log.net>0].count()/log.net.count())*100

user_id    13.8
time       13.3
bet        13.8
win        13.8
net        13.8
dtype: float64

In [32]:
(log[log.net<0].count()/log.net.count())*100

user_id    34.7
time       33.9
bet        34.7
win        34.7
net        34.7
dtype: float64

In [33]:
log = pd.read_csv('log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']
min_bet = log.bet.min()
min_bet_amount = log[log.bet == min_bet].bet.count()
min_bet_amount

48

In [34]:
log.user_id

0      Запись пользователя № - user_919
1      Запись пользователя № - user_973
2      Запись пользователя № - user_903
3      Запись пользователя № - user_954
4      Запись пользователя № - user_954
                     ...
995    Запись пользователя № - user_984
996                              #error
997                              #error
998                              #error
999                              #error
Name: user_id, Length: 1000, dtype: object

In [35]:
users = pd.read_csv('users.csv', sep='\t', encoding='koi8_r', header=None)
users.columns = ['user_id', 'email', 'geo']

In [36]:
users

      user_id                     email          geo
0      Юзверь                      мейл          Гео
1    User_943       Accumanst@gmail.com       Ижевск
2    User_908         Advismowr@mail.ru       Ижевск
3    User_962           Anachso@ukr.net    Краснодар
4    User_973          Antecia@inbox.ru        Пермь
..        ...                       ...          ...
96   User_959  UpdatesCurious@yahoo.com       Тюмень
97   User_901        V2artierso@mail.ru  Арзангелтск
98   User_970          Vashoterlo@bk.ru      Воронеж
99   User_965       Visuareda@yahoo.com      Воронеж
100  User_921              Aavast@ya.ru       Ижевск

[101 rows x 3 columns]

In [37]:
log

                              user_id                  time      bet      win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [38]:
# Приведем признак user_id к одному формату в обоих датасетах  
users.user_id = users.user_id.apply(lambda x: x.lower())  
# Избавимся от ошибок в user_id  
log = log[log.user_id != '#error']  
log.user_id = log.user_id.str.split('-').apply(lambda x: x[1])  
log.user_id

/Users/Ivan/opt/anaconda3/lib/python3.8/site-packages/pandas/core/generic.py:5303: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

0       user_919
1       user_973
2       user_903
3       user_954
4       user_954
         ...
991     user_965
992     user_967
993     user_973
994     user_977
995     user_984
Name: user_id, Length: 985, dtype: object

In [39]:
import pandas as pd
log_users = pd.merge(log, users, on='user_id')

In [40]:
type(users.user_id[0])

str

In [41]:
import pandas as pd

log = pd.read_csv('log.csv',header=None)
log.columns = ['user_id', 'time', 'bet', 'win']

log.bet=log['bet'].fillna(0)
log.win=log['win'].fillna(0)
log.time = log.time.str.replace('[', '')
log['net']=log['win']-log['bet']
log = log[log.user_id != '#error']

users = pd.read_csv('users.csv', encoding='koi8_r', sep='\t')
users.columns = ['user_id','email','geo']

users.user_id = users.user_id.apply(lambda x: x.lower())
log.user_id = log.user_id.str.split(' - ').apply(lambda x: x[1])

merged = pd.merge(log, users, on='user_id')

In [42]:
merged

,user_id,time,bet,win,net,email,geo
0,user_919,2019-01-01 14:06:51,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
1,user_919,2019-01-30 10:06:00,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
2,user_919,2019-02-05 14:33:44,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
3,user_919,2019-02-14 11:38:05,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
4,user_919,2019-03-02 4:23:36,300.0,0.0,-300.0,Chikkaverle@icloud.com,Хабаровск
...,...,...,...,...,...,...,...
970,user_932,2019-02-24 22:40:06,0.0,0.0,0.0,BraceWalker@bk.ru,Красноярск
971,user_932,2019-03-15 10:56:14,0.0,0.0,0.0,BraceWalker@bk.ru,Красноярск
972,user_932,2019-03-18 10:13:24,0.0,0.0,0.0,BraceWalker@bk.ru,Красноярск
973,user_932,2019-03-27 12:18:24,0.0,0.0,0.0,BraceWalker@bk.ru,Красноярск
974,user_932,2019-04-18 14:55:26,700.0,6640.0,5940.0,BraceWalker@bk.ru,Красноярск

In [43]:
merged.groupby('user_id').net.sum().median()

1986.0

In [44]:
Отдельно считаем число ставок, равных 0 и ставок, больше чем 0
group = df[df.bet==0].groupby('user_id').bet.count()
group_not_null = df[df.bet>0].groupby('user_id').bet.count()
После чего делим сумму (sum()) количества ставок, равных 0, на количество групп user_id
Вам нужно поделить количество раз, когда bet = 0 в группировке по юзерам, т.е.:
group = df[df.bet==0].groupby('user_id').bet.count()
group.sum()/len(group)

grouped = merged_df.groupby('user_id')
zero_bets = grouped['bet'].agg(
    cond = lambda x: (x.where(x == 0).count() > 0 and x.where(x > 0).count() > 0) or (x.where(x > 0).count() == len(x)),
    count = lambda x: x.where(x == 0).count()
)
zero_bets[zero_bets['cond']]['count'].mean()



Добрый день!
Дело в том, что в датасете нет клиентов, у которых есть только посещения, без ставок, поэтому ваш ответ принимается.
Но по хорошему это нужно учитывать
Мы делаем 2 группировки (где bet==0, и где bet !=0)
group = df[df.bet==0].groupby('user_id').bet.count()
group_not_null = df[df.bet>0].groupby('user_id').bet.count()
Мы можем объединить 2 получившихся объекта в один датафрейм
joined=pd.merge(group, group_not_null, on=['user_id'])
Оставим только те строки, в которых у посетителя была хотя бы одна ставка
joined = joined[joined['bet_y']>0]
И посчитаем среднее количество приходов без ставки
joined['bet_x'].sum()/len(joined

SyntaxError: invalid syntax (<ipython-input-44-7783786f1601>, line 1)

Сколько раз в среднем каждый человек приходит, не делая ставок, при условии, что у этого человека все-таки есть хотя бы одна ставка? Например: Человек посетил букмекерскую контору 5 раз из них 1 раз сделал ставку, 4 раза нет - условие выполняется. Человек посетил букмекерскую контору 5 раз из них ни разу ставку не сделал - условие не выполняется. Для того, чтобы узнать это, просуммируйте в каждой группе количество записей со ставкой, равной 0, и поделите на общее количество групп. Если при этом в группе нет записей со ставкой больше 0, считаем количество записей в данной группе равным 0.

In [51]:
import pandas as pd

log = pd.read_csv('log.csv',header=None)
log.columns = ['user_id', 'time', 'bet', 'win']

log.bet=log['bet'].fillna(0)
log.win=log['win'].fillna(0)
log.time = log.time.str.replace('[', '')
log['net']=log['win']-log['bet']
log = log[log.user_id != '#error']
log.time = pd.to_datetime(log.time)

users = pd.read_csv('users.csv', encoding='koi8_r', sep='\t')
users.columns = ['user_id','email','geo']

users.user_id = users.user_id.apply(lambda x: x.lower())
log.user_id = log.user_id.str.split(' - ').apply(lambda x: x[1])

merged = pd.merge(log, users, on='user_id')

zero_bet = merged[merged.bet==0].groupby('user_id').bet.count()
made_bet = merged[merged.bet>0].groupby('user_id').bet.count()
zero_bet.sum()/len(zero_bet)

5.05

Сколько в среднем времени проходит между появлением человека в сервисе и первой ставкой? Считать нужно только тех, кто делал ставку. Для того, чтобы узнать это, напишите метод, считающий минимальное время среди ставок, равных 0, и минимальное время среди ставок больше 0. После этого верните разницу между вторым и первым числом. Пройдитесь по всем группам. Если в группе нет ставок больше 0, пропустите эту группу. Просуммируйте разницу во времени для каждой группы (с помощью метода, описанного выше) и поделите на количество групп, которые вы не пропустили.

In [60]:
min_time_zero_bet = merged[merged.bet==0].groupby('user_id').time.min()
min_time_bet = merged[merged.bet>0].groupby('user_id').time.min()
difference = min_time_bet - min_time_zero_bet
result = difference.sum()/len(difference)

In [61]:
result

Timedelta('46 days 06:54:48')

In [67]:
merged.groupby('geo').win.sum().sort_values(ascending=False)

geo
Москва             11959741.0
Воронеж              184338.0
Санкт-Петербург      151007.0
Казань                97806.0
Ярославль             97441.0
Ижевск                84895.0
Красноярск            84767.0
Арзангелтск           74375.0
Пермь                 67734.0
Хабаровск             65459.0
Краснодар             62718.0
Ставрополь            46003.0
Екатеринбург          36682.0
Тюмень                 4701.0
Name: win, dtype: float64

In [71]:
minimal = merged[merged.bet>0].groupby('geo').bet.mean().min()
maximum = merged[merged.bet>0].groupby('geo').bet.mean().max()
result = maximum/minimal
result

127.81602335164835

In [72]:
merged.groupby('geo').user_id.count()

geo
Арзангелтск         96
Воронеж             88
Екатеринбург        49
Ижевск              61
Казань              66
Краснодар           86
Красноярск          56
Москва              61
Пермь               55
Санкт-Петербург    115
Ставрополь          36
Тюмень              32
Хабаровск           60
Ярославль           89
Name: user_id, dtype: int64